rottenpotatoes-rails-intro/app/controllers/movies_controller.rb

  def index
    # Obtener todas las películas o filtrar por calificaciones seleccionadas
    @movies = params[:ratings] ? Movie.with_ratings(params[:ratings].keys) : Movie.all
---
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13', 'R')  ORDER BY release_date asc