rottenpotatoes-rails-intro/app/views/movies/index.html.erb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('PG-13', 'R')  ORDER BY release_date asc
---
    <%= label_tag 'Include:' %>
    <% Movie.all_ratings.each do |rating| %>